resource "iosxe_interface_port_channel" "po10" {
    name                        = 1          # 1 a 512
    #description                 = "Aggregat vers xxxxxxxxx"
    #shutdown                    = false
}



# iosxe_interface_port_channel.po10 will be created
  + resource "iosxe_interface_port_channel" "po10" {
      + description                    = (known after apply)
      + id                             = (known after apply)
      + ip_access_group_in             = (known after apply)
      + ip_access_group_in_enable      = true
      + ip_access_group_out            = (known after apply)
      + ip_access_group_out_enable     = true
      + ip_dhcp_relay_source_interface = (known after apply)
      + ipv4_address                   = (known after apply)
      + ipv4_address_mask              = (known after apply)
      + name                           = 1
      + shutdown                       = (known after apply)
      + switchport                     = (known after apply)
      + vrf_forwarding                 = (known after apply)
    }

  # iosxe_username.userbase will be updated in-place
  ~ resource "iosxe_username" "userbase" {
        id                  = "Cisco-IOS-XE-native:native/username=userbase"
        name                = "userbase"
      + privilege           = 1
      + secret              = (known after apply)
      + secret_encryption   = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # iosxe_vlan.vlan_100 must be replaced
-/+ resource "iosxe_vlan" "vlan_100" {
      ~ id                       = "Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=100" -> (known after apply)
      + name                     = "vlan_100"
      + private_vlan_association = (known after apply)
      ~ private_vlan_community   = false -> (known after apply)
      ~ private_vlan_isolated    = false -> (known after apply)
      ~ private_vlan_primary     = false -> (known after apply)
      ~ remote_span              = false -> (known after apply)
      ~ vlan_id                  = 0 -> 100 # forces replacement
        # (1 unchanged attribute hidden)
    }

  # iosxe_vlan.vlan_101 must be replaced
-/+ resource "iosxe_vlan" "vlan_101" {
      ~ id                       = "Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=101" -> (known after apply)
      + name                     = "vlan_101"
      + private_vlan_association = (known after apply)
      ~ private_vlan_community   = false -> (known after apply)
      ~ private_vlan_isolated    = false -> (known after apply)
      ~ private_vlan_primary     = false -> (known after apply)
      ~ remote_span              = false -> (known after apply)
      ~ vlan_id                  = 0 -> 101 # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 3 to change, 2 to destroy.
iosxe_vlan.vlan_101: Destroying... [id=Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=101]
iosxe_vlan.vlan_100: Destroying... [id=Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=100]
iosxe_vlan.vlan_101: Destruction complete after 0s
iosxe_banner.banner: Modifying... [id=Cisco-IOS-XE-native:native/banner]
iosxe_interface_port_channel.po10: Creating...
iosxe_access_list_standard.allowed_all: Modifying... [id=Cisco-IOS-XE-native:native/ip/access-list/Cisco-IOS-XE-acl:standard=allow_all]
iosxe_vlan.vlan_100: Destruction complete after 0s
iosxe_vlan.vlan_101: Creating...
iosxe_username.userbase: Modifying... [id=Cisco-IOS-XE-native:native/username=userbase]
iosxe_vlan.vlan_100: Creating...
iosxe_banner.banner: Modifications complete after 0s [id=Cisco-IOS-XE-native:native/banner]
iosxe_interface_port_channel.po10: Still creating... [10s elapsed]
iosxe_access_list_standard.allowed_all: Still modifying... [id=Cisco-IOS-XE-native:native/ip/access-list/Cisco-IOS-XE-acl:standard=allow_all, 10s elapsed]
iosxe_vlan.vlan_101: Still creating... [10s elapsed]
iosxe_username.userbase: Still modifying... [id=Cisco-IOS-XE-native:native/username=userbase, 10s elapsed]
iosxe_vlan.vlan_100: Still creating... [10s elapsed]
iosxe_interface_port_channel.po10: Still creating... [20s elapsed]
iosxe_access_list_standard.allowed_all: Still modifying... [id=Cisco-IOS-XE-native:native/ip/access-list/Cisco-IOS-XE-acl:standard=allow_all, 20s elapsed]
iosxe_vlan.vlan_101: Still creating... [20s elapsed]
iosxe_username.userbase: Still modifying... [id=Cisco-IOS-XE-native:native/username=userbase, 20s elapsed]
iosxe_vlan.vlan_100: Still creating... [20s elapsed]
iosxe_username.userbase: Modifications complete after 29s [id=Cisco-IOS-XE-native:native/username=userbase]
iosxe_access_list_standard.allowed_all: Modifications complete after 29s [id=Cisco-IOS-XE-native:native/ip/access-list/Cisco-IOS-XE-acl:standard=allow_all]
iosxe_vlan.vlan_100: Creation complete after 29s [id=Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=100]
iosxe_vlan.vlan_101: Creation complete after 29s [id=Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=101]
╷
│ Error: Client Error
│ 
│   with iosxe_interface_port_channel.po10,
│   on iosxe_int_portchannel.tf line 8, in resource "iosxe_interface_port_channel" "po10":
│    8: resource "iosxe_interface_port_channel" "po10" {
│ 
│ Failed to configure object (PATCH), got error: HTTP Request failed: StatusCode 400, RESTCONF errors
│ {Error:[{ErrorType:application ErrorTag:invalid-value ErrorAppTag:
│ ErrorPath:/Cisco-IOS-XE-native:native/interface/Port-channel ErrorMessage:inconsistent value: Device refused one or
│ more commands ErrorInfo:}]} {PatchId: GlobalStatus:{Ok:false Errors:{Error:[]}} EditStatus:{Edit:[]}}
╵